export interface Attraction {
    name: string;
    description: string;
    imageUrl: string;
  }
  
  export interface Place {
    city: string;
    distanceAndTime: string;
    attractions: Attraction[];
  }

export const Splaces: Place[] = [
    {
        city: 'Приморск',
        distanceAndTime: '150 км, 2 часа',
        attractions: [
          {
            name: 'Парк Приморский',
            description: 'Красивый парк у моря, идеально подходит для прогулок.',
            imageUrl: 'https://example.com/primorsky_park.jpg',
          },
          {
            name: 'Музей Приморска',
            description: 'Музей истории города и его окрестностей.',
            imageUrl: 'https://example.com/primorsk_museum.jpg',
          }
        ]
    },
    {
      city: 'Высоцк',
      distanceAndTime: 'Примерно 160 км, 2.5 часа',
      attractions: [
        {
          name: 'Крепость',
          description: 'Взять с собой фонарики. Можно пройтись внутри остатков крепости, посидеть у воды, если повезет - искупаться. Лучше поехать днем.',
          imageUrl: 'https://upload.wikimedia.org/wikipedia/commons/6/65/%D0%A2%D1%80%D0%BE%D0%BD%D0%B3%D0%B7%D1%83%D0%BD%D0%B4._%D0%92%D1%85%D0%BE%D0%B4_%D0%B2_%D0%BA%D0%B0%D0%B7%D0%B0%D1%80%D0%BC%D1%8B.jpg'
        }
      ]
    },
    {
      city: 'Граница с Финкой',
      distanceAndTime: 'Примерно 160 км, 2.5 часа.',
      attractions: []
    }
];

export const Lplaces: Place[] = [
  {city: 'Псков',
   distanceAndTime: 'Примерно 295 км, 4.5 часа.',
   attractions: [
      {
          name: 'Псковский Кремль',
          description: 'Псковский Кремль - сердце города и один из самых древних кремлей в России. Основанный в X веке, он служил важным оборонительным сооружением и административным центром Псковской земли. Вход может быть платным.',
          imageUrl: 'https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/df/8d/73/photo7jpg.jpg?w=1200&h=-1&s=1'
      },
      {
          name: 'Мирожский монастырь',
          description: 'Основанный в XII веке, монастырь известен своими уникальными фресками, выполненными византийскими мастерами. Они сохранились с древнейших времён и являются одними из лучших примеров древнерусской живописи. Вход на территорию монастыря бесплатный, осмотр собора стоит 250 рублей.',
          imageUrl: 'https://dynamic-media-cdn.tripadvisor.com/media/photo-o/04/7f/6e/a6/caption.jpg?w=1100&h=-1&s=1'
      },
      {
        name: 'Мирожский дендропарк',
        description: 'Мирожский дендропарк находится за оградой монастыря, на берегу маленькой речки Мирожи, которая дала название монастырю. Долгие годы парк стоял заброшенным, но в 2013 году его благоустроили, и теперь это очень комфортное место для прогулок: там много зелени, кленовые и березовые аллеи, газоны, пешеходные дорожки.',
        imageUrl: 'https://topgid.net/uploads/posts/2020-10/1602627341_mirozhskij-dendropark.jpg'
      },
      {
        name: 'Набережная',
        description: "Набережная находится на правом берегу Великой. В отличие от левой стороны реки, набережная здесь полностью благоустроена. Она двухуровневая: на верхнем уровне туристы и местные гуляют, занимаются спортом, перекусывают, сидя на скамейках с видом на реку. На нижнем уровне мужчины удят рыбу.",
        imageUrl: 'https://img-fotki.yandex.ru/get/15488/39978190.c0/0_95f60_2851c25e_XXL.jpg'
      },
      {
        name: 'Поганкины палаты',
        description: 'Палаты находятся рядом с главным зданием Псковского музея-заповедника. Это постройки 17 века, возведенные по заказу купца Поганкина. Сейчас они внесены в список объектов всемирного наследия Юнеско. Купец жил здесь вместе с семьей, а в подвалах хранил товары. Мне не удалось их посмотреть: в 2019 году Поганкины палаты были на реставрации. В 2022 году палаты открылись. В 2023 там проходят выставки, афиша есть на сайте музея. На постоянной экспозиции представлены старинные монеты, серебро и другие артефакты из клада, который обнаружили в Пскове в 2016 году.',
        imageUrl:'https://museumpskov.ru/uploads/objects/poganki1400_b7a864a8bf.jpg'
      }
   ],
      
  },
  {
      city: 'Великий Новгород',
      distanceAndTime: 'Примерно 190 км, 2.5-3 часа',
      attractions: [
        {
          name: 'Софийская площадь',
          description: 'Главная площадь города. Здесь находятся два здания с колоннами — местного правительства и Музея изобразительных искусств. По периметру расположены лавочки, но большая часть площади — ровный асфальт.',
          imageUrl: 'https://opis-cdn.tinkoffjournal.ru/mercury/velikiynovgorod-one-day-20.trx4v6.jpg?preset=image_760w',
        },
        {
          name: 'Кремлевский парк',
          description: 'В Кремлевском парке можно обойти кремль с внешней стороны. Вокруг кремля есть дорожка для пешеходов и велосипедистов, на главной аллее парка установлены лавочки, работают стационарные и передвижные лотки, где можно взять перекус.',
          imageUrl: 'https://opis-cdn.tinkoffjournal.ru/mercury/velikiynovgorod-one-day-22.m7yf5c.jpg?preset=image_760w',
        },
        {
          name: 'Новгородский кремль',
          description: 'Кремль, он же Детинец, — это крепость из красного кирпича, окруженная рвом с одной стороны и рекой с другой. Там можно подняться наверх и пройтись по стене сквозь несколько башен. Билет на боевой ход вместе с осмотром звонницы для взрослых стоит 350 ₽.',
          imageUrl: 'https://opis-cdn.tinkoffjournal.ru/mercury/velikiynovgorod-one-day-24.ttlwda.jpg?preset=image_760w'
        },
        {
          name: 'Памятник Тысячелетию России',
          description: 'Памятник установили в 1862 году в честь тысячелетия истории страны. Он разделен на три зоны. В верхней части расположен ангел, который благословляет православную женщину, олицетворяющую Россию. Затем следуют композиции на тему становления государственности. На последнем ярусе памятника изображены люди, которые внесли заметный вклад в историю страны: писатели, историки, военные чиновники, герои войн, музыканты и композиторы.',
          imageUrl: 'https://opis-cdn.tinkoffjournal.ru/mercury/velikiynovgorod-one-day-50.pcrozz.jpg?preset=image_760w'
        },
        {
          name: 'Софийский собор',
          description: 'Это главный православный храм Новгорода. Его в 1050 году построил сын Ярослава Мудрого Владимир. Это действующий храм, который открыт для посещения ежедневно с 08:00 до 20:00. Вход бесплатный. Наверху звонницы есть смотровая площадка, которая работает с мая по сентябрь. Билет стоит 200 ₽. Оттуда открывается отличный вид на Волхов и Ярославово дворище — территорию на противоположном берегу реки, где находятся несколько церквей и аркада Гостиного двора.',
          imageUrl: 'https://opis-cdn.tinkoffjournal.ru/mercury/velikiynovgorod-one-day-06.lmzreukmlbe9.jpg?preset=image_570w_2x'
        },
        {
          name: 'Софийская набережная',
          description: 'Набережную построили в конце 2021 года, а все ее объекты заработали весной 2022. Раньше на этой территории был заросший кустами берег, а теперь это мое любимое место в центре города. Мне нравится приезжать сюда на велосипеде или самокате из Кремлевского парка, сидеть у реки, слушать концерты. Еще тут можно перекусить и поиграть с детьми на площадке.',
          imageUrl: 'https://opis-cdn.tinkoffjournal.ru/mercury/velikiynovgorod-one-day-30.zxbun1.jpg?preset=image_570w_2x'
        },
        {
          name: 'Ярославово дворище',
          description: 'Это несколько церквей, расположенных рядом друг с другом на небольшой территории на противоположном от кремля берегу Волхова. По территории дворища можно прогуляться к Воротной башне Гостиного двора, Никольскому собору, церкви Параскевы Пятницы и другим объектам. Здесь очень зелено — летом здорово спасаться от жары, сидя в тени на лавочках.',
          imageUrl: 'https://opis-cdn.tinkoffjournal.ru/mercury/velikiynovgorod-one-day-37.qz8qje.jpg?preset=image_570w_2x'
        }
      ]
  },
  {
    city: 'Карелия (Рускеала + Сортавала)',
    distanceAndTime: 'Примерно 300 км, 4-5 часов',
    attractions: [
      {
        name: 'Горный парк Рускеала',
        description: 'Горный парк основан на месте бывших каменоломен, а в трёх десятках километров от него находится город Сортавала. В XVIII веке, когда в этих местах стали добывать карельский мрамор, здесь появился рабочий посёлок Рускеала. Тысячи тонн камня доставлялись в Сортавалу, откуда волоком по Ладожскому озеру их перевозили в Северную столицу — для строительства дворцов и соборов Санкт-Петербурга.',
        imageUrl: 'https://icdn.bolshayastrana.com/940x00/a0/9d/a09d9c09c1777b5f6f4ae71a56ea66cb.jpeg'
      },
      {
        name: 'Рускеальские водопады',
        description: 'Рускеальские (Тохминские) водопады — воплощение природной грандиозности и величия в самом сердце карельской дикой природы. Они раскрываются перед глазами туристов во всей своей великолепной красоте, окутывая каждого посетителя неповторимой мощью водной стихии. Это место погружает вас в чарующую атмосферу, где вы можете почувствовать гармонию и единение с природой.',
        imageUrl: 'https://icdn.bolshayastrana.com/1200x00/61/ac/61ac957c9009fb31cde4b707a821aafb.jpeg'
      },
      {
        name: 'Водопад Кивач',
        description: 'Самый интересный из водопадов Республики Карелия — Кивач (от финского «мощный, быстрый»). Находится он на реке Суна в Кондопожском районе, на территории одноимённой заповедной зоны. От Петрозаводска его отделяют 70 километров. Кивач, спускающийся тремя уступами общей длиной 170 метров и перепадом высоты около 11 метров, занимает по величине второе место в Европе после Рейнского водопада.',
        imageUrl: 'https://icdn.bolshayastrana.com/940x00/14/83/1483b7dae8b8c039593a8ff99ba856f9.jpeg'
      },
      {
        name: 'Висячие озёра и урочище Велемоны',
        description: 'Ближайшая от Пегремы деревня Уница находится не так далеко — всего лишь в трёх десятках километров. А в Уницком районе есть красивейшее место под названием Висячие озёра. Эту красоту обязательно нужно увидеть. Висячими называют соединённые перешейками каскады водоёмов, каждый из которых расположен ниже предыдущего. Находятся Висячие озёра в скальном грунте урочища Велемоны — огромном каньоне, образованном землетрясением 4 тысячи лет назад. ',
        imageUrl: 'https://icdn.bolshayastrana.com/940x00/b6/07/b607a0d64a17858404cc456847f159ed.jpeg'  
      }
    ]
  },
  {
    city: 'Беларусь',
    distanceAndTime: 'Примерно 820 км, 11 часов',
    attractions: [
      {
        name: 'Мирский замок (п. Мир)',
        description: 'С середины XIII века и до конца XVIII существовало Великое княжество Литовское, а в состав его земель полностью входила современная территория Беларуси. Мирский замок — это наследие тех времен, принадлежавшее Юрию Ильиничу — государственному деятелю и представителю могучего в то время рода. Замок построен в готическом стиле с некоторыми особенностями, характерными в XVI веке для регионов Беларуси, Польши и Украины.',
        imageUrl: 'https://avatars.dzeninfra.ru/get-zen_doc/5268479/pub_5ea323ad54eee5440a2338d5_63d95de73a663b6c8a8a69e0/scale_1200'
      },
      {
        name: 'Несвижский замок (г. Несвиж)',
        description: 'Ещё одна легенда, объединяющая Несвижский и Мирский замки, гласит, что между ними проложен тоннель длиной более 30 км, и именно по нему призраки Чёрная Дева и Сонечка ходят друг к другу в гости. Этот замок чуть моложе, так как был построен примерно в 1600 году для князя Радивилла Сиротки. Здесь уже отчетливо видно влияние барокко, так как замок спроектировал итальянский архитектор Джованни Бернардони.',
        imageUrl: 'https://avatars.dzeninfra.ru/get-zen_doc/5130440/pub_5ea323ad54eee5440a2338d5_63d95df0954fd401fa221c87/scale_1200'
      },
      {
        name: 'Костел святых Симеона и Елены (г. Минск)',
        description: 'Костелом называли польские католические храмы, но позже этот термин стали применять к церквям данной конфессии в Чехии, Беларуси, Словакии и ряде других стран. Католицизм — это вторая по популярности религия в стране, поэтому и храмов здесь довольно много. Костел Святого Симеона и Елены является известнейшим в Минске, и был построен чуть больше ста лет назад.',
        imageUrl: 'https://avatars.dzeninfra.ru/get-zen_doc/1775615/pub_5ea323ad54eee5440a2338d5_63d95df9f40d25431739b120/scale_1200'
      },
      {
        name: 'Национальная библиотека Беларуси (г. Минск)',
        description: 'Хотя само учреждение «Национальная библиотека Беларуси» основано ещё 100 лет назад, новое здание начали строить в начале двухтысячных. Его трудно пропустить из-за необычного внешнего вида: здание выполнено в форме ромбокубооктаэдра, а в народе его именуют проще — «алмазом». В 2006 здание библиотеки достроили, после чего в течение нескольких месяцев многотонными партиями свозили книги и документацию.',
        imageUrl: 'https://avatars.dzeninfra.ru/get-zen_doc/1602486/pub_5ea323ad54eee5440a2338d5_63d95e019e99e03fc12f753c/scale_1200'
      },
      {
        name: 'Национальный академический большой театр оперы и балета (г. Минск)',
        description: 'Конструктивизм, возникший в раннем СССР, подарил миру много архитектурных шедевров, но Большой театр Беларуси заслуживает отдельного внимания. Изначально архитектор Иосиф Лонгбард хотел сделать здание ещё более монструозным, но на согласовании проекта заявили, что нельзя допустить, чтобы театр в Минске был по размерам больше московского. Хотя размах стал скромнее, основная задумка автора сохранилась и радует глаз по сей день.',
        imageUrl: 'https://avatars.dzeninfra.ru/get-zen_doc/4715514/pub_5ea323ad54eee5440a2338d5_63d95e0b3e1c91442f60c762/scale_1200'
      }
    ]
  }
];